import 'package:flutter/material.dart';
import '../../../utils/constance.dart';
import '../../../utils/styles.dart';

class TermsOfUseScreen extends StatelessWidget {
  const TermsOfUseScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: const Color(0xFFFFFFFF),
      appBar: AppBar (
        title: const Text(
          'سياسة الخصوصية',
        ),
      ),
      body: ListView(
        padding: const EdgeInsets.symmetric(horizontal: defaultPadding,vertical: 12.0),
        children: const [
          SizedBox(height: 17.0,),
          Text(
            'ضوابط وشروط وأحكام المستخدم لمنصة طاير\n \nتمثل هذه الضوابط والشروط اتفاق رسمي "عقد" بين منصة مرسول والعملاء المستخدمين لمنصة طاير\nوالذي هو عبارة عن منصة إلكترونية تسمح للمندوبين بتقديم خدمات الشراء نيابة عن العملاء والتوصيل إلى منازلهم أو في المواقع التي يتم تحديدها مسبقاً من العملاء، حيث يقوم "مرسول" بإتاحة الفرصة للعميل لاختيار المندوب المناسب للقيام بعملية التوصيل. \nإن أي استخدام من قبلك للخدمات التي توفرها منصة مرسول  يشكل موافقة منك على هذا العقد وأحكامه، وتبعاً لذلك يجب عليك عدم استخدام المنصة في حال لم تكن موافقاً على الأحكام والشروط الواردة في هذا العقد.\n تحتفظ مرسول  بحق تعديل أو تغيير هذه الأحكام والشروط دون إخطار مسبق، ويكون من مسؤوليتك كمستخدم للمنصة مراجعة ضوابط وشروط الاستخدام بشكل دوري لمعرفة التحديثات التي تطرأ على الأحكام والشروط هذه،  كما نأمل مراجعة سياسة الخصوصية لدينا لمعرفة المزيد حول كيفية استخدام مرسول  للمعلومات التي تقدم لنا من قبل مستخدمي المنصة.\n\nأحقية الحصول على الخدمات\n\nأنت تقر وتضمن التالي:\n\nأنه لم يسبق أن تم تعطيل استخدامك لخدمات طاير  أو منعك من استخدامها في أي وقت من الأوقات.\n\nأنك لست منافساً لمرسول ، كما أنك لا تقدم أي منتج منافس للخدمات المقدمة من طاير .\n\nأنك تتمتع بكامل القوة والسلطة للتعاقد وأنك بذلك لن تكون منتهكاً لأي قانون أو عقد، وأنه لا يوجد عليك أي سوابق قضائية أو أوامر قبض أو مطالبات لدى الجهات الأمنية.\n\n \nالتعهدات والضمانات\nأنت تقر وتضمن بأنك سوف:\n\nتمتثل لكافة القوانين واللوائح المعمول بها في المملكة العربية السعودية.\n\nتقدم معلومات صحيحة ودقيقة إلى مرسول  وتقوم بتحديثها بشكل دوري.\n\nتراجع وتمتثل لأي إشعارات يتم إرسالها من خلال مرسول  فيما يتعلق باستخدامكم للخدمات المقدمة من منصة مرسول.\n\nسوف تستخدم الخدمة أو المنصة لأغراض مشروعة فقط، ولن تستخدم الخدمات لشراء أواستلام أي مواد غير قانونية أو بهدف الاحتيال.\n\nلن تستخدم الخدمة أو المنصة للتسبب بإيذاء أو مضايقة أو إزعاج أحد ما.\n\nتوافق على تبادل المعلومات بين الشركات داخل المنصة فيما يخص عملياتك المنفذة وتقييم التعاملات معك.\n\nلن تعرقل التشغيل السليم لمنصة مرسول.\n\nلن تحاول إلحاق الضرر بالخدمة أو المنصة بأي شكل من الأشكال.\n\nلن تنسخ أو توزع المنصة أو المحتويات الأخرى دون الحصول على إذن كتابي من مرسول .\n\nسوف تحافظ على كلمة المرور لحسابك أو أي وسيلة تعريف نقدمها لك وتتيح الدخول إلى حسابك، بشكلٍ آمن وسري.\n\nسوف تقدم لنا كافة الدلائل التي تثبت هويتك وفقاً لتقدير مرسول  الخاص.\n\nيحق لـمرسول  رفض تقديم الخدمة أو استخدام المنصة دون إبداء أسباب.\n\nنطاق الترخيص\n\nتمنحك مرسول  ترخيص غير حصري، وغير قابل للتحويل، وغير قابل للتنازل، وغير قابل للترخيص من الباطن وغير قابل للإلغاء وذلك للحصول على خدماتنا واستخدامها فقط للغرض الشخصي (ليس لأي أغراض تجارية على سبيل المثال لا الحصر) وفقاً لهذا العقد، لذا يجب عليك:\n\nعدم إتاحة الخدمات أوتأجير، أواستئجار أوتخصيص أوإعادة بيع، أو توزيع أو ترخيص من الباطن لهذه الخدمات إلى أي طرف ثالث.\n\nعدم تعديل، أو اجتزاء، أو ترجمة، أو تلخيص، أو إنشاء عمل فرعي يقوم على فك، أو تنفيذ هندسة عكسية لتصميم منصة مرسول  أو خلاف ذلك من تحديد أو محاولة تحديد أو محاولة الوصول إلى شفرة المصدر أو التصميم الداخلي للخدمات أو أي نص، أو صور الوسائط المتعددة (صور، صوتيات، ملفات فيديو)،  أو البيانات أو غيرها من المعلومات التي تقدمها مرسول  أو الطرف الثالث من مقدمي الخدمة.\n\nعدم حذف، أو تغيير، أو غير ذلك من التعديل على أي حق من حقوق النشر أو غيرها من الإخطارات الرسمية الواردة في الخدمات.\n\n عدم تعمد نقل، أو توزيع الخدمات، أو السماح بتحميل الخدمات للاستخدام بخلاف ما هو محدد هنا.\n',
            style: StyleManager.titleStyle12,
          ),
        ],
      ),
    );
  }
}
